pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
   </registers>
  </peripheral>
<!--ADC 10-bit Analog to Digital Converter-->
  <peripheral>
   <name>AESKEYS</name>
   <description>AES Key Registers.</description>
   <baseAddress>0x40005000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>KEY0</name>
     <description>AES Key 0.</description>
     <addressOffset>0x000</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY1</name>
     <description>AES Key 1.</description>
     <addressOffset>0x080</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY2</name>
     <description>AES Key 2.</description>
     <addressOffset>0x100</addressOffset>
     <size>32</size>
    </register>
    <register>
     <name>KEY3</name>
     <description>AES Key 3.</description>
     <addressOffset>0x180</addressOffset>
     <size>32</size>
    </register>
   </registers>
  </peripheral>
<!--AESKEYS AES Key Registers.-->
  <peripheral>
   <name>DMA</name>
   <description>DMA Controller Fully programmable, chaining capable DMA channels.</description>
   <baseAddress>0x40028000</baseAddress>
   <size>32</size>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>DMA0_CH0</name>
    <value>28</value>
   </interrupt>
   <interrupt>
    <name>DMA0_CH1</name>
    <value>29</value>
   </interrupt>
   <interrupt>
    <name>DMA0_CH2</name>
    <value>30</value>
   </interrupt>
   <interrupt>
    <name>DMA0_CH3</name>
    <value>31</value>
   </interrupt>
   <interrupt>
    <name>DMA0_CH4</name>
    <value>68</value>
   </interrupt>
   <interrupt>
    <name>DMA0_CH5</name>
    <value>69</value>
   </interrupt>
   <interrupt>
    <name>DMA0_CH6</name>
    <value>70</value>
   </interrupt>
   <interrupt>
    <name>DMA0_CH7</name>
    <value>71</value>
   </interrupt>
   <registers>
    <register>
     <name>CN</name>
     <description>DMA Control Register.</description>
     <addressOffset>0x000</addressOffset>
     <fields>
      <field>
       <name>CH0_IEN</name>
       <description>Channel 0 Interrupt Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="CH0_IEN">
       <name>CH1_IEN</name>
       <description>Channel 1 Interrupt Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IEN">
       <name>CH2_IEN</name>
       <description>Channel 2 Interrupt Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IEN">
       <name>CH3_IEN</name>
       <description>Channel 3 Interrupt Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IEN">
       <name>CH4_IEN</name>
       <description>Channel 4 Interrupt Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IEN">
       <name>CH5_IEN</name>
       <description>Channel 5 Interrupt Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IEN">
       <name>CH6_IEN</name>
       <description>Channel 6 Interrupt Enable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IEN">
       <name>CH7_IEN</name>
       <description>Channel 7 Interrupt Enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INTR</name>
     <description>DMA Interrupt Register.</description>
     <addressOffset>0x004</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>CH0_IPEND</name>
       <description>Channel 0 Interrupt Pending.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="CH0_IPEND">
       <name>CH1_IPEND</name>
       <description>Channel 1 Interrupt Pending.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IPEND">
       <name>CH2_IPEND</name>
       <description>Channel 2 Interrupt Pending.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IPEND">
       <name>CH3_IPEND</name>
       <description>Channel 3 Interrupt Pending.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IPEND">
       <name>CH4_IPEND</name>
       <description>Channel 4 Interrupt Pending.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IPEND">
       <name>CH5_IPEND</name>
       <description>Channel 5 Interrupt Pending.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IPEND">
       <name>CH6_IPEND</name>
       <description>Channel 6 Interrupt Pending.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_IPEND">
       <name>CH7_IPEND</name>
       <description>Channel 7 Interrupt Pending.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
