pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
   </registers>
  </peripheral>
<!--DVS Dynamic Voltage Scaling-->
  <peripheral>
   <name>FCR</name>
   <description>Function Control.</description>
   <baseAddress>0x40000800</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>FCR</name>
     <description>Register 0.</description>
     <addressOffset>0x00</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>USB_CLK_SEL</name>
       <description>USB External Core Clock Select.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>sys</name>
         <description>Generated clock from system clock.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dig</name>
         <description>Digital clock from a GPIO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>QSPI0_FNC_SEL</name>
       <description>SPI0 Function Select.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>hirc</name>
         <description>High speed 96MHz oscillator.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ext_clk</name>
         <description>External clock input.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C0_SDA_FILTER_EN</name>
       <description>I2C0 SDA Pad Deglitcher enable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C0_SCL_FILTER_EN</name>
       <description>I2C0 SCL Pad Deglitcher enable.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C1_SDA_FILTER_EN</name>
       <description>I2C1 SDA Pad Deglitcher enable.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C1_SCL_FILTER_EN</name>
       <description>I2C1 SCL Pad Deglitcher enable.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--FCR Function Control.-->
  <peripheral>
   <name>FLC</name>
   <description>Flash Memory Control.</description>
   <prependToName>FLSH_</prependToName>
   <baseAddress>0x40029000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>Flash_Controller</name>
    <description>Flash Controller interrupt.</description>
    <value>23</value>
   </interrupt>
   <registers>
    <register>
     <name>ADDR</name>
     <description>Flash Write Address.</description>
     <addressOffset>0x00</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>Address for next operation.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CLKDIV</name>
     <description>Flash Clock Divide. The clock (PLL0) is divided by this value to generate a 1 MHz clock for Flash controller.</description>
     <addressOffset>0x04</addressOffset>
     <resetValue>0x00000064</resetValue>
     <fields>
      <field>
       <name>CLKDIV</name>
       <description>Flash Clock Divide. The clock is divided by this value to generate a 1MHz clock for flash controller.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CN</name>
     <description>Flash Control Register.</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>WR</name>
       <description>Write.  This bit is automatically cleared after the operation.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>complete</name>
         <description>No operation/complete.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>start</name>
         <description>Start operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="WR">
       <name>ME</name>
       <description>Mass Erase.  This bit is automatically cleared after the operation.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="WR">
       <name>PGE</name>
       <description>Page Erase.  This bit is automatically cleared after the operation.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERASE_CODE</name>
       <description>Erase Code.  The ERASE_CODE must be set up property before erase operation can be initiated. These bits are automatically cleared after the operation is complete.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>8</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>nop</name>
         <description>No operation.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>erasePage</name>
         <description>Enable Page Erase.</description>
         <value>0x55</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>eraseAll</name>
         <description>Enable Mass Erase. The debug port must be enabled.</description>
         <value>0xAA</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PEND</name>
       <description>Flash Pending.  When Flash operation is in progress (busy), Flash reads and writes will fail. When PEND is set, write to all Flash registers, with exception of the Flash interrupt register, are ignored.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>idle</name>
         <description>Idle.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>busy</name>
         <description>Busy.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>UNLOCK</name>
       <description>Flash Unlock.  The correct unlock code must be written to these four bits before any Flash write or erase operation is allowed.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>4</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>unlocked</name>
         <description>Flash Unlocked.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>locked</name>
         <description>Flash Locked.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INTR</name>
     <description>Flash Interrupt Register.</description>
     <addressOffset>0x024</addressOffset>
     <fields>
      <field>
       <name>DONE</name>
       <description>Flash Done Interrupt.  This bit is set to 1 upon Flash write or erase completion.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No interrupt is pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AF</name>
       <description>Flash Access Fail.  This bit is set when an attempt is made to write the flash while the flash is busy or the flash is locked. This bit can only be set to 1 by hardware.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>noError</name>
         <description>No Failure.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>error</name>
         <description>Failure occurs.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DONEIE</name>
       <description>Flash Done Interrupt Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>disable</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>enable</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="DONEIE">
       <name>AFIE</name>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECC_DATA</name>
     <description>Flash Controller ECC Data Register.</description>
     <addressOffset>0x28</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>ECC_EVEN</name>
       <description>Error Correction Code Even Data.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>ECC_ODD</name>
       <description>Error Correction Code Odd Data.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>4</dimIncrement>
     <name>DATA[%s]</name>
     <description>Flash Write Data.</description>
     <addressOffset>0x30</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data next operation.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ACTNL</name>
     <description>Access Control Register. Writing the ACNTL register with the following values in the order shown, allows read and write access to the system and user Information block: pflc-acntl = 0x3a7f5ca3; pflc-acntl = 0xa1e34f20; pflc-acntl = 0x9608b2c1. When unlocked, a write of any word will disable access to system and user information block. Readback of this register is always zero.</description>
     <addressOffset>0x40</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>ACNTL</name>
       <description>Access control.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
