pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
   </registers>
  </peripheral>
<!--FLC Flash Memory Control.-->
  <peripheral derivedFrom="FLC">
   <name>FLC1</name>
   <description>Flash Memory Control. 1</description>
   <baseAddress>0x40029400</baseAddress>
   <interrupt>
    <name>FLC1</name>
    <description>FLC1 IRQ</description>
    <value>87</value>
   </interrupt>
  </peripheral>
<!--FLC1 Flash Memory Control. 1-->
  <peripheral>
   <name>GCR</name>
   <description>Global Control Registers.</description>
   <baseAddress>0x40000000</baseAddress>
   <addressBlock>
    <offset>0</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>SCON</name>
     <description>System Control.</description>
     <addressOffset>0x00</addressOffset>
     <resetMask>0xFFFFFFFE</resetMask>
     <fields>
      <field>
       <name>BSTAPEN</name>
       <description>Boundary Scan TAP enable. When enabled, the JTAG port is connected to the Boundary Scan TAP. Otherwise, the port is connected to the ARM ICE function. This bit is reset by the POR. Reset value and access depend on the part number.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Boundary Scan TAP port disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Boundary Scan TAP port enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SBUSARB</name>
       <description>System bus abritration scheme. These bits are used to select between Fixed-burst abritration and Round-Robin scheme. The Round-Robin scheme is selected by default. These bits are reset by the system reset.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>fix</name>
         <description>Fixed Burst abritration.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>round</name>
         <description>Round-robin scheme.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FLASH_PAGE_FLIP</name>
       <description>Flips the Flash bottom and top halves. (Depending on the total flash size, each half is either 256K or 512K). Initiating a flash page flip will cause a flush of both the data buffer on the DCODE bus and the internal instruction buffer.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Physical layout matches logical layout.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>swapped</name>
         <description>Bottom half mapped to logical top half and vice versa.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CCACHE_FLUSH</name>
       <description>Code Cache Flush. This bit is used to flush the code caches and the instruction buffer of the Cortex-M4. </description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Code Cache Operation</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>flush</name>
         <description>Code Caches and CPU instruction buffer are flushed </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DCACHE_FLUSH</name>
       <description>Data Cache Flush. The system cache(s) will be flushed when this bit is set. </description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal System Cache Operation</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>flush</name>
         <description>System Cache is flushed </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRCC_DIS</name>
       <description>SPIXR Cache Controller Disable. Disables the SRCC used for SPIXR code and data cache. Setting this field disables the cache and bypasses the cache line buffer.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Is enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Is Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CCHK</name>
       <description>Compute ROM Checksum. This bit is self-cleared when calculation is completed. Once set, software clearing this bit is ignored and the bit will remain set until the operation is completed.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>complete</name>
         <description>No operation/complete.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>start</name>
         <description>Start operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CHKRES</name>
       <description>ROM Checksum Result. This bit is only valid when CHKRD=1.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>pass</name>
         <description>ROM Checksum Correct.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>fail</name>
         <description>ROM Checksum Fail.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>OVR</name>
       <description>Operating Voltage Range. Setting these bits according to the VCore voltage allows the on-chip Random-Access memories to operate in their optimal timing range.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_9V</name>
         <description>0.9V +/- 10%</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_0V</name>
         <description>1.0V +/- 10%</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_1V</name>
         <description>1.1V +/- 10%</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>RSTR0</name>
     <description>Reset.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>DMA</name>
       <description>DMA Reset.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>reset</name>
        <usage>read-write</usage>
        <enumeratedValue>
         <name>reset_done</name>
         <description>Reset complete.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>busy</name>
         <description>Starts Reset or indicates reset in progress.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="DMA">
       <name>WDT0</name>
       <description>Watchdog Timer Reset.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>GPIO0</name>
       <description>GPIO0 Reset. Setting this bit to 1 resets GPIO0 pins to their default states.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>GPIO1</name>
       <description>GPIO1 Reset. Setting this bit to 1 resets GPIO1 pins to their default states.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>TIMER0</name>
       <description>Timer0 Reset. Setting this bit to 1 resets Timer 0 blocks.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>TIMER1</name>
       <description>Timer1 Reset. Setting this bit to 1 resets Timer 1 blocks.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>TIMER2</name>
       <description>Timer2 Reset. Setting this bit to 1 resets Timer 2 blocks.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>TIMER3</name>
       <description>Timer3 Reset. Setting this bit to 1 resets Timer 3 blocks.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>TIMER4</name>
       <description>Timer3 Reset. Setting this bit to 1 resets Timer 4 blocks.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>TIMER5</name>
       <description>Timer3 Reset. Setting this bit to 1 resets Timer 5 blocks.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>UART0</name>
       <description>UART0 Reset. Setting this bit to 1 resets all UART 0 blocks.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>UART1</name>
       <description>UART1 Reset. Setting this bit to 1 resets all UART 1 blocks.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>SPI1</name>
       <description>SPI1 Reset. Setting this bit to 1 resets all SPI 1 blocks.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>SPI2</name>
       <description>SPI2 Reset. Setting this bit to 1 resets all SPI 2 blocks.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>I2C0</name>
       <description>I2C0 Reset.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>RTC</name>
       <description>Real Time Clock Reset.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>CRYPTO</name>
       <description>Cryptographic Reset. Setting this bit to 1 resets the AES block, the SHA block and the DES block.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>SMPHR</name>
       <description>SMPHR Reset. Setting this bit to 1 resets the SMPHR block.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>USB</name>
       <description>USB Reset. Setting this bit resets both USB blocks.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>ADC</name>
       <description>Analog to Digital Reset.</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>DMA1</name>
       <description>DMA 1 Reset.</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>UART2</name>
       <description>UART2 Reset. Setting this bit to 1 resets all UART 2 blocks.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>SRST</name>
       <description>Soft Reset. Setting this bit to 1 resets everything except the CPU and the watchdog timer.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>PRST</name>
       <description>Peripheral Reset. Setting this bit to 1 resets all peripherals. The CPU core, the watchdog timer, and all GPIO pins are unaffected by this reset.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="DMA">
       <name>SYSTEM</name>
       <description>System Reset. Setting this bit to 1 resets the CPU core and all peripherals, including the watchdog timer.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CLKCN</name>
     <description>Clock Control.</description>
     <addressOffset>0x08</addressOffset>
     <resetValue>0x00000008</resetValue>
     <fields>
      <field>
       <name>PSC</name>
       <description>Prescaler Select. This 3 bit field sets the system operating frequency by controlling the prescaler that divides the output of the PLL0.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>div1</name>
         <description>Divide by 1.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div2</name>
         <description>Divide by 2.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div4</name>
         <description>Divide by 4.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div8</name>
         <description>Divide by 8.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div16</name>
         <description>Divide by 16.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div32</name>
         <description>Divide by 32.</description>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div64</name>
         <description>Divide by 64.</description>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div128</name>
         <description>Divide by 128.</description>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CLKSEL</name>
       <description>Clock Source Select. This 3 bit field selects the source for the system clock.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>HIRC</name>
         <description>HIRC Clock</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>XTAL32M</name>
         <description>32MHz Crystal is used for the system clock.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>LIRC8</name>
         <description>8kHz LIRC is used for the system clock.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HIRC96</name>
         <description>The internal 96 MHz oscillator is used for the system clock.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>HIRC8</name>
         <description>The internal 8 MHz oscillator is used for the system clock.</description>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>XTAL32k</name>
         <description> 32kHz is used for the system clock.</description>
         <value>6</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CKRDY</name>
       <description>Clock Ready. This read only bit reflects whether the currently selected system clock source is running.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>busy</name>
         <description>Switchover to the new clock source (as selected by CLKSEL) has not yet occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>System clock running from CLKSEL clock source.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CCD</name>
       <description>Cryptographic clock divider</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>non_div</name>
         <description>The cryptographic accelerator clock is running in non-divided mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div</name>
         <description>The cryptographic accelerator clock is running in divided mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>X32M_EN</name>
       <description>32MHz Crystal Oscillator Enable.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Is Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Is Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>X32K_EN</name>
       <description>32kHz Crystal Oscillator Enable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Is Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Is Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="X32K_EN">
       <name>HIRC_EN</name>
       <description>60MHz High Frequency Internal Reference Clock Enable.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="X32K_EN">
       <name>HIRC96M_EN</name>
       <description>96MHz High Frequency Internal Reference Clock Enable.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="X32K_EN">
       <name>HIRC8M_EN</name>
       <description>8MHz High Frequency Internal Reference Clock Enable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>HIRC8M_VS</name>
       <description>8MHz High Frequency Internal Reference Clock Voltage Select. This register bit is used to select the power supply to the HIRC8M.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Vcor</name>
         <description>VCore Supply</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1V</name>
         <description>Dedicated 1v regulated supply.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>X32M_RDY</name>
       <description>32MHz Crystal Oscillator Ready</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Is not Ready.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>Is Ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>X32K_RDY</name>
       <description>32kHz Crystal Oscillator Ready</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Is not Ready.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>Is Ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="X32K_RDY">
       <name>HIRC_RDY</name>
       <description>60MHz HIRC Ready.</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="X32K_RDY">
       <name>HIRC96M_RDY</name>
       <description>96MHz HIRC Ready.</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="X32K_RDY">
       <name>HIRC8M_RDY</name>
       <description>8MHz HIRC Ready.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
