pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
    <register>
     <name>PM</name>
     <description>Power Management.</description>
     <addressOffset>0x0C</addressOffset>
     <fields>
      <field>
       <name>MODE</name>
       <description>Operating Mode. This two bit field selects the current operating mode for the device. Note that code execution only occurs during ACTIVE mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>Active Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>deepsleep</name>
         <description>DeepSleep Mode.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>backup</name>
         <description>Backup Mode.</description>
         <value>4</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>GPIOWKEN</name>
       <description>GPIO Wake Up Enable. This bit enables all GPIO pins as potential wakeup sources. Any GPIO configured for wakeup is capable of causing an exit from IDLE or STANDBY modes when this bit is set.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Wake Up Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Wake Up Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="GPIOWKEN">
       <name>RTCWKEN</name>
       <description>RTC Alarm Wake Up Enable. This bit enables RTC alarm as wakeup source. If enabled, the desired RTC alarm must be configured via the RTC control registers.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIOWKEN">
       <name>USBWKEN</name>
       <description>USB Wake Up Enable. This bit enables USB activity as wakeup source.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIOWKEN">
       <name>WUTWKEN</name>
       <description>WUT Wake Up Enable. This bit enables WUT IRQ as wakeup source.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIOWKEN">
       <name>compwken</name>
       <description>COMPARATOR Input Wake Up Enable. This bit enables COMP IRQ activity as wakeup source.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>HIRCPD</name>
       <description>HIRC Power Down. This bit selects HIRC power state in DEEPSLEEP mode. </description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>Mode is Active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>deepsleep</name>
         <description>Powered down in DEEPSLEEP.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="HIRCPD">
       <name>HIRC96MPD</name>
       <description>96MHz power down. This bit selects 96MHz HIRC power state in DEEPSLEEP mode. </description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="HIRCPD">
       <name>HIRC8MPD</name>
       <description>8MHz power down. This bit selects 8MHz HIRC power state in DEEPSLEEP mode. </description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>XTALPB</name>
       <description>32MHz Bluetooth Oscillator Bypass. </description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PCKDIV</name>
     <description>Peripheral Clock Divider.</description>
     <addressOffset>0x18</addressOffset>
     <resetValue>0x00000001</resetValue>
     <fields>
      <field>
       <name>SDHCFRQ</name>
       <description>SDHC Clock Frequency. This bits defines the clock frequency of SDHC.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>48MHz</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>24MHz</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADCFRQ</name>
       <description>ADC clock Frequency. These bits define the ADC clock frequency. FADC = FPCLK/(ADCFRQ).</description>
       <bitOffset>10</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>AONCD</name>
       <description>Always-ON(AON) domain CLock Divider. These bits define the AON domain clock divider.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>div_4</name>
         <description>PCLK divide by 4.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div_8</name>
         <description>PCLK divide by 8.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div_16</name>
         <description>PCLK divide by 16.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div_32</name>
         <description>PCLK divide by 32.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>PERCKCN0</name>
     <description>Peripheral Clock Disable.</description>
     <addressOffset>0x24</addressOffset>
     <fields>
      <field>
       <name>GPIO0D</name>
       <description>GPIO0 Disable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>enable it.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>disable it.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="GPIO0D">
       <name>GPIO1D</name>
       <description>GPIO1 Disable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>USBD</name>
       <description>USB Disable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>DMAD</name>
       <description>DMA Disable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>SPI1D</name>
       <description>SPI 1 Disable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>SPI2D</name>
       <description>SPI 2 Disable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>UART0D</name>
       <description>UART 0 Disable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>UART1D</name>
       <description>UART 1 Disable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>I2C0D</name>
       <description>I2C 0 Disable.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>CRYPTOD</name>
       <description>Crypto Disable.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>TIMER0D</name>
       <description>Timer 0 Disable.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>TIMER1D</name>
       <description>Timer 1 Disable.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>TIMER2D</name>
       <description>Timer 2 Disable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>TIMER3D</name>
       <description>Timer 3 Disable.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>TIMER4D</name>
       <description>Timer 4 Disable.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>TIMER5D</name>
       <description>Timer 5 Disable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>ADCD</name>
       <description>ADC Disable.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>I2C1D</name>
       <description>I2C 1 Disable.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>PTD</name>
       <description>PT Clock Disable.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>SPIXIPD</name>
       <description>SPI XiP Disable.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0D">
       <name>SPIMD</name>
       <description>SPI XiP Master Controller Disable.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MEMCKCN</name>
     <description>Memory Clock Control Register.</description>
     <addressOffset>0x28</addressOffset>
     <fields>
      <field>
       <name>FWS</name>
       <description>Flash Wait State. These bits define the number of wait-state cycles per Flash data read access. Minimum wait state is 2.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>SYSRAM0LS</name>
       <description>System RAM 0 Light Sleep Mode.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>RAM is active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>light_sleep</name>
         <description>RAM is in Light Sleep mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>SYSRAM1LS</name>
       <description>System RAM 1 Light Sleep Mode.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>SYSRAM2LS</name>
       <description>System RAM 2 Light Sleep Mode.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>SYSRAM3LS</name>
       <description>System RAM 3 Light Sleep Mode.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>SYSRAM4LS</name>
       <description>System RAM 4 Light Sleep Mode.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>SYSRAM5LS</name>
       <description>System RAM 5 Light Sleep Mode.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>SYSRAM6LS</name>
       <description>System RAM 6 Light Sleep Mode.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>ICACHELS</name>
       <description>ICache RAM Light Sleep Mode.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>ICACHEXIPLS</name>
       <description>ICACHE-XIP RAM Light Sleep Mode.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>SCACHELS</name>
       <description>SysCache RAM Light Sleep Mode.</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>CRYPTOLS</name>
       <description>CRYPTO RAM Light Sleep Mode.</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>USBLS</name>
       <description>USB FIFO Light Sleep Mode.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>ROM0LS</name>
       <description>ROM Light Sleep Mode.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>ROM1LS</name>
       <description>ROM1 Light Sleep Mode.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SYSRAM0LS">
       <name>ICACHE1LS</name>
       <description>ICache RAM Light Sleep Mode.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MEMZCN</name>
     <description>Memory Zeroize Control.</description>
     <addressOffset>0x2C</addressOffset>
     <fields>
      <field>
       <name>SRAM0Z</name>
       <description>System RAM Block 0.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>nop</name>
         <description>No operation/complete.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>start</name>
         <description>Start operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>SRAM1Z</name>
       <description>System RAM Block 1.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>SRAM2</name>
       <description>System RAM Block 2.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>SRAM3Z</name>
       <description>System RAM Block 3.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>SRAM4Z</name>
       <description>System RAM Block 4.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>SRAM5Z</name>
       <description>System RAM Block 5.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>SRAM6Z</name>
       <description>System RAM Block 6.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>ICACHEZ</name>
       <description>Instruction Cache.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>ICACHEXIPZ</name>
       <description>Instruction Cache XIP Data and Tag Ram zeroizatoin.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>SCACHEDATAZ</name>
       <description>System Cache Data Ram Zeroization.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>SCACHETAGZ</name>
       <description>System Cache Tag Zeroization.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>CRYPTOZ</name>
       <description>Crypto (MAA) Memory.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>USBFIFOZ</name>
       <description>USB FIFO Zeroizatoin.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="SRAM0Z">
       <name>ICACHE1Z</name>
       <description>Instruction Cache.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SYSST</name>
     <description>System Status Register.</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>ICELOCK</name>
       <description>ARM ICE Lock Status.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>unlocked</name>
         <description>ICE is unlocked.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>locked</name>
         <description>ICE is locked.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CODEINTERR</name>
       <description>Code Integrity Error Flag. This bit indicates a code integrity error has occured in XiP interface. </description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>norm</name>
         <description>Normal Operating Condition.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>code</name>
         <description>Code Integrity Error.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SCMEMF</name>
       <description>System Cache Memory Fault Flag. This bit indicates a memory fault has occured in the System Cache while receiving data from the Hyperbus Interface.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>norm</name>
         <description>Normal Operating Condition.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>memory</name>
         <description>Memory Fault.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
