pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
    <register>
     <name>RSTR1</name>
     <description>Reset 1.</description>
     <addressOffset>0x44</addressOffset>
     <fields>
      <field>
       <name>I2C1</name>
       <description>I2C1 Reset.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>reset_read</name>
        <usage>read</usage>
        <enumeratedValue>
         <name>reset_done</name>
         <description>Reset complete.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>busy</name>
         <description>Starts reset or indicates reset in progress.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="I2C1">
       <name>PT</name>
       <description>PT Reset.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>SPIXIP</name>
       <description>SPI XiP Master Reset.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>XSPIM</name>
       <description>GSPI XiP Master Controller Reset.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>SDHC</name>
       <description>SDHC/SDIO Reset.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>OWIRE</name>
       <description>OWIRE Reset.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>WDT1</name>
       <description>WDT1 Reset.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>SPI0</name>
       <description>SPI0 Reset.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>SPIXMEM</name>
       <description>SPIXMEM Reset.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>SMPHR</name>
       <description>SMPHR Reset.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>WDT2</name>
       <description>WDT2 Reset.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>BTLE</name>
       <description>BTLE Reset.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>AUDIO</name>
       <description>AUDIO Reset.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>I2C2</name>
       <description>I2C2 Reset.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>RPU</name>
       <description>RPU Reset.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>HTMR0</name>
       <description>HTMR0 Reset.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>HTMR1</name>
       <description>HTMR1 Reset.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>DVS</name>
       <description>DVS Reset.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C1">
       <name>SIMO</name>
       <description>SIMO Reset.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PERCKCN1</name>
     <description>Peripheral Clock Disable.</description>
     <addressOffset>0x48</addressOffset>
     <fields>
      <field>
       <name>BTLED</name>
       <description>BTLE Disable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>UART2D</name>
       <description>UART2 Disable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="UART2D">
       <name>TRNGD</name>
       <description>TRNG Disable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>SCACHED</name>
       <description>System Cache Clock Disable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>SDMAD</name>
       <description>SDMA Clock Disable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>SMPHRD</name>
       <description>Semaphore Clock Disable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>SDHCD</name>
       <description>SDHC/SDIO Clock Disable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>ICACHEXIPD</name>
       <description>ICache XIP Clock Disable.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>OWIRED</name>
       <description>One-Wire Clock Disable.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>SPI0D</name>
       <description>SPI0 Clock Disable.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>SPIXIPDD</name>
       <description>SPI-XIP Data Clock Disable</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>DMA1D</name>
       <description>DMA1 Clock Disable</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>AUDIOD</name>
       <description>AUDIO Clock Disable</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>I2C2D</name>
       <description>I2C 2 Clock Disable</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>HTMR0D</name>
       <description>HTMR 0 Clock Disable</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>HTMR1D</name>
       <description>HTMR 1 Clock Disable</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>WDT0D</name>
       <description>WDT0 Clock Disable</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>WDT1D</name>
       <description>WDT1 Clock Disable</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>WDT2D</name>
       <description>WDT2 Clock Disable</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="UART2D">
       <name>CPU1D</name>
       <description>CPU1 Clock Disable</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>EVENT_EN</name>
     <description>Event Enable Register.</description>
     <addressOffset>0x4C</addressOffset>
     <fields>
      <field>
       <name>CPU0DMAEVENT</name>
       <description>Enable DMA event. When this bit is set, a DMA event will cause an RXEV event to wake the CPU from WFE sleep mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CPU0DMA1EVENT</name>
       <description>Enable RXEV pin event. When this bit is set, a logic high of GPIO0[24] will cause an RXEV event to wake the CPU from WFE sleep mode. </description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CPU0TXEVENT</name>
       <description>Enable TXEV pin event. When this bit is set, TXEV event from the CPU is output to GPIO[25].</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CPU1DMAEVENT</name>
       <description>Enable DMA event. When this bit is set, a DMA event will cause an RXEV event to wake the CPU from WFE sleep mode.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CPU1DMA1EVENT</name>
       <description>Enable RXEV pin event. When this bit is set, a logic high of GPIO0[24] will cause an RXEV event to wake the CPU from WFE sleep mode. </description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CPU1TXEVENT</name>
       <description>Enable TXEV pin event. When this bit is set, TXEV event from the CPU is output to GPIO[25].</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>REVISION</name>
     <description>Revision Register.</description>
     <addressOffset>0x50</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>REVISION</name>
       <description>Manufacturer Chip Revision. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SYSSIE</name>
     <description>System Status Interrupt Enable Register.</description>
     <addressOffset>0x54</addressOffset>
     <fields>
      <field>
       <name>ICEULIE</name>
       <description>ARM ICE Unlock Interrupt Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="ICEULIE">
       <name>CIEIE</name>
       <description>Code Integrity Error Interrupt Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="ICEULIE">
       <name>SCMFIE</name>
       <description>System Cache Memory Fault Interrupt Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECC_ER</name>
     <description>ECC Error Register</description>
     <addressOffset>0x64</addressOffset>
     <fields>
      <field>
       <name>SYSRAM0ECCERR</name>
       <description>ECC System RAM0 Error Flag. Write 1 to clear.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM1ECCERR</name>
       <description>ECC System RAM1 Error Flag. Write 1 to clear.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM2ECCERR</name>
       <description>ECC System RAM2 Error Flag. Write 1 to clear.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM3ECCERR</name>
       <description>ECC System RAM3 Error Flag. Write 1 to clear.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM4ECCERR</name>
       <description>ECC System RAM4 Error Flag. Write 1 to clear.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM5ECCERR</name>
       <description>ECC System RAM5 Error Flag. Write 1 to clear.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM6ECCERR</name>
       <description>ECC System RAM6 Error Flag. Write 1 to clear.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IC0ECCERR</name>
       <description>ECC Icache0 Error Flag. Write 1 to clear.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IC1ECCERR</name>
       <description>ECC Icache1 Error Flag. Write 1 to clear.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICXIPECCERR</name>
       <description>ECC IcacheXIP Error Flag. Write 1 to clear.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FL0ECCERR</name>
       <description>ECC Flash0 Error Flag. Write 1 to clear.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FL1ECCERR</name>
       <description>ECC Flash1 Error Flag. Write 1 to clear.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECC_CED</name>
     <description>ECC Correctable Error Detected Register</description>
     <addressOffset>0x68</addressOffset>
     <fields>
      <field>
       <name>SYSRAM0ECCNDED</name>
       <description>ECC System RAM0 Error Flag. Write 1 to clear.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM1ECCNDED</name>
       <description>ECC System RAM1 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM2ECCNDED</name>
       <description>ECC System RAM2 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM3ECCNDED</name>
       <description>ECC System RAM3 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM4ECCNDED</name>
       <description>ECC System RAM4 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM5ECCNDED</name>
       <description>ECC System RAM5 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IC0ECCNDED</name>
       <description>ECC Icache0 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IC1ECCNDED</name>
       <description>ECC Icache1 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICXIPECCNDED</name>
       <description>ECC IcacheXIP Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FL0ECCNDED</name>
       <description>ECC Flash0 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FL1ECCNDED</name>
       <description>ECC Flash1 Not Double Error Detect. Write 1 to clear.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECC_IRQEN</name>
     <description>ECC IRQ Enable Register</description>
     <addressOffset>0x6C</addressOffset>
     <fields>
      <field>
       <name>SYSRAM0ECCEN</name>
       <description>System RAM0 ECC Error Interrupt Enable</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM1ECCEN</name>
       <description>System RAM1 ECC Error Interrupt Enable</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM2ECCEN</name>
       <description>System RAM2 ECC Error Interrupt Enable</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM3ECCEN</name>
       <description>System RAM3 ECC Error Interrupt Enable</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM4ECCEN</name>
       <description>System RAM4 ECC Error Interrupt Enable</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SYSRAM5ECCEN</name>
       <description>System RAM5 ECC Error Interrupt Enable</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IC0ECCEN</name>
       <description>Icache0 ECC Error Interrupt Enable</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IC1ECCEN</name>
       <description>Icache1 ECC Error Interrupt Enable</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICXIPECCEN</name>
       <description>IcacheXIP ECC Error Interrupt Enable</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FL0ECCEN</name>
       <description>Flash0 NError ECC Interrupt Enable</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FL1ECCEN</name>
       <description>Flash1 ECC Error Interrupt Enable</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECC_ERRAD</name>
     <description>ECC Error Address Register</description>
     <addressOffset>0x70</addressOffset>
     <fields>
      <field>
       <name>DATARAMADDR</name>
       <description>ECC Error Address.Data Ram Address.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>13</bitWidth>
      </field>
      <field>
       <name>DATARAMBANK</name>
       <description>ECC Error Address.Data Error Bank.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATARAMERR</name>
       <description>ECC Error Address.Data Ram Error.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TAGRAMADDR</name>
       <description>ECC Error Address.Tag Ram Address.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>13</bitWidth>
      </field>
      <field>
       <name>TAGRAMBANK</name>
       <description>ECC Error Address.Tag Ram Bank.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TAGRAMERR</name>
       <description>ECC Error Address.Tag Ram Error.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
