pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
    <register>
     <name>BTLE_LDOCR</name>
     <description>BTLE LDO Control Register</description>
     <addressOffset>0x74</addressOffset>
     <fields>
      <field>
       <name>LDOTXEN</name>
       <description>LDOTX Enable</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDOTXOPULLD</name>
       <description>LDOTX PULL Disable</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDOTXVSEL</name>
       <description>LDOTX Voltage Setting</description>
       <bitOffset>2</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_7</name>
         <description>0.7V</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>0_85</name>
         <description>0.85V</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>0_9</name>
         <description>0.9V</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_1</name>
         <description>1.1V</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORXEN</name>
       <description>LDORX Enable</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORXPULLD</name>
       <description>LDORX Pulldown</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORXVSEL</name>
       <description>LDORX Output Voltage Setting</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_7</name>
         <description>0.7V</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>0_85</name>
         <description>0.85V</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>0_9</name>
         <description>0.9V</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_1</name>
         <description>1.1V</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORXBYP</name>
       <description>LDORX Bypass Enable</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORXDISCH</name>
       <description>LDORX Discharge</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDOTXBYP</name>
       <description>LDOTX Bypass Enable</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDOTXDISCH</name>
       <description>LDOTX Discharge</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDOTXENDLY</name>
       <description>LDOTX Enable Delay</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORXENDLY</name>
       <description>LDORX Enable Delay</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORXBYPENENDLY</name>
       <description>LDOTX Bypass Enable Delay</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDOTXBYPENENDLY</name>
       <description>LDORX Bypass Enable Delay</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BTLE_LDODCR</name>
     <description>BTLE LDO Delay Register</description>
     <addressOffset>0x78</addressOffset>
     <fields>
      <field>
       <name>BYPDLYCNT</name>
       <description>Bypass Delay Count. Count delay base on PCLK.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>LDORXDLYCNT</name>
       <description>LDORX Delay Count. Count delay base on PCLK/128.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
      <field>
       <name>LDOTXDLYCNT</name>
       <description>LDOTX Delay Count. Count delay base on PCLK/128.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>GP0</name>
     <description>General Purpose Register 0</description>
     <addressOffset>0x80</addressOffset>
     <fields>
      <field>
       <name>GPR0</name>
       <description>User-defined register RAM.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>APB_ASYNC</name>
     <description>APB Asynchronous Bridge Select Register</description>
     <addressOffset>0x84</addressOffset>
     <fields>
      <field>
       <name>APBASYNCI2C0</name>
       <description>Feeds I2C0 with either PCLK or 7.37MHz Clk</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>pclk</name>
         <description>PCLK Source</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>7mclk</name>
         <description>7.37MHz Source</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="APBASYNCI2C0">
       <name>APBASYNCI2C1</name>
       <description>Feeds I2C1 with either PCLK or 7.37MHz Clk</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="APBASYNCI2C0">
       <name>APBASYNCI2C2</name>
       <description>Feeds I2C2 with either PCLK or 7.37MHz Clk</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="APBASYNCI2C0">
       <name>APBASYNCPT</name>
       <description>Feeds PT with either PCLK or 7.37MHz Clk</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
