pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
    <register>
     <name>DMA</name>
     <description>DMA Register.</description>
     <addressOffset>0x48</addressOffset>
     <fields>
      <field>
       <name>TXEN</name>
       <description>TX channel enable.</description>
       <bitRange>[0:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RXEN</name>
       <description>RX channel enable.</description>
       <bitRange>[1:1]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SLAVE_ADDR</name>
     <description>Slave Address Register.</description>
     <addressOffset>0x4C</addressOffset>
     <fields>
      <field>
       <name>SLAVE_ADDR</name>
       <description>Slave Address.</description>
       <bitRange>[9:0]</bitRange>
      </field>
      <field>
       <name>EX_ADDR</name>
       <description>Extended Address Select.</description>
       <bitRange>[15:15]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>7_bits_address</name>
         <description>7-bit address.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>10_bits_address</name>
         <description>10-bit address.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--I2C0 Inter-Integrated Circuit.-->
  <peripheral derivedFrom="I2C0">
   <name>I2C1</name>
   <description>Inter-Integrated Circuit. 1</description>
   <baseAddress>0x4001E000</baseAddress>
   <interrupt>
    <name>I2C1</name>
    <description>I2C1 IRQ</description>
    <value>36</value>
   </interrupt>
  </peripheral>
<!--I2C1 Inter-Integrated Circuit. 1-->
  <peripheral derivedFrom="I2C0">
   <name>I2C2</name>
   <description>Inter-Integrated Circuit. 2</description>
   <baseAddress>0x4001F000</baseAddress>
   <interrupt>
    <name>I2C2</name>
    <description>I2C2 IRQ</description>
    <value>62</value>
   </interrupt>
  </peripheral>
<!--I2C2 Inter-Integrated Circuit. 2-->
  <peripheral>
   <name>ICC0</name>
   <description>Instruction Cache Controller Registers</description>
   <baseAddress>0x4002A000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CACHE_ID</name>
     <description>Cache ID Register.</description>
     <addressOffset>0x0000</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>RELNUM</name>
       <description>Release Number. Identifies the RTL release version.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>PARTNUM</name>
       <description>Part Number. This field reflects the value of C_ID_PART_NUMBER configuration parameter.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>CCHID</name>
       <description>Cache ID. This field reflects the value of the C_ID_CACHEID configuration parameter.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MEMCFG</name>
     <description>Memory Configuration Register.</description>
     <addressOffset>0x0004</addressOffset>
     <access>read-only</access>
     <resetValue>0x00080008</resetValue>
     <fields>
      <field>
       <name>CCHSZ</name>
       <description>Cache Size. Indicates total size in Kbytes of cache.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
      <field>
       <name>MEMSZ</name>
       <description>Main Memory Size. Indicates the total size, in units of 128 Kbytes, of code memory accessible to the cache controller.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CACHE_CTRL</name>
     <description>Cache Control and Status Register.</description>
     <addressOffset>0x0100</addressOffset>
     <fields>
      <field>
       <name>EN</name>
       <description>Cache Enable. Controls whether the cache is bypassed or is in use. Changing the state of this bit will cause the instruction cache to be flushed and its contents invalidated.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Cache Bypassed. Instruction data is stored in the line fill buffer but is not written to main cache memory array.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Cache Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RDY</name>
       <description>Cache Ready flag. Cleared by hardware when at any time the cache as a whole is invalidated (including a system reset). When this bit is 0, the cache is effectively in bypass mode (instruction fetches will come from main memory or from the line fill buffer). Set by hardware when the invalidate operation is complete and the cache is ready.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>notReady</name>
         <description>Not Ready.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>Ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INVALIDATE</name>
     <description>Invalidate All Registers.</description>
     <addressOffset>0x0700</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>INVALID</name>
       <description>Invalidate.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
