pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
   </registers>
  </peripheral>
<!--ICC0 Instruction Cache Controller Registers-->
  <peripheral derivedFrom="ICC0">
   <name>ICC1</name>
   <description>Instruction Cache Controller Registers 1</description>
   <baseAddress>0x4002AC000</baseAddress>
  </peripheral>
<!--ICC1 Instruction Cache Controller Registers 1-->
  <peripheral>
   <name>MCR</name>
   <description>Misc Control.</description>
   <baseAddress>0x40006C00</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>ECCEN</name>
     <description>ECC Enable Register</description>
     <addressOffset>0x00</addressOffset>
     <fields>
      <field>
       <name>SYSRAM0ECCEN</name>
       <description>ECC System RAM Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SYSRAM1ECCEN</name>
       <description>ECC System RAM Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SYSRAM2ECCEN</name>
       <description>ECC System RAM Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SYSRAM3ECCEN</name>
       <description>ECC System RAM Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SYSRAM4ECCEN</name>
       <description>ECC System RAM Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SYSRAM5ECCEN</name>
       <description>ECC System RAM Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IC0ECCEN</name>
       <description>Icache0 ECC Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IC1ECCEN</name>
       <description>Icache1 ECC Enable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ICXIPFECCEN</name>
       <description>IcacheXIP ECC Enable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FL0ECCEN</name>
       <description>Flash0 ECC Enable.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FL1ECCEN</name>
       <description>Flash1 ECC Enable.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>HIRC96M</name>
     <description>96MHz High Frequency Clock Adjustment Register</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>HIRC96MTR</name>
       <description>HIRC96M Trim: Allow user to change 96M Frequency</description>
       <bitOffset>0</bitOffset>
       <bitWidth>9</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>default</name>
         <description>Default setting.</description>
         <value>0x100</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>OUTEN</name>
     <description>GPIOOUT_EN Function Enable Register</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>SQWOUT0EN</name>
       <description>Allows SQWOUT on GPIO0_19</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SQWOUT1EN</name>
       <description>Allows SQWOUT on GPIO0_27</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PDOWNOUT0EN</name>
       <description>Allows PDOWN on GPIO0_18</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PDOWNOUT1EN</name>
       <description>Allows PDOWN on GPIO0_26</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>AINCOMP</name>
     <description>Comparator Power Control Register</description>
     <addressOffset>0x0C</addressOffset>
     <fields>
      <field>
       <name>AINCOMP0PD</name>
       <description>Power Down AIN Comp0</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>on</name>
         <description>power on</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>off</name>
         <description>power off</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AINCOMP1PD</name>
       <description>Power Down AIN Comp1</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>on</name>
         <description>power on</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>off</name>
         <description>power off</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AINCOMP2PD</name>
       <description>Power Down AIN Comp2</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>on</name>
         <description>power on</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>off</name>
         <description>power off</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AINCOMP3PD</name>
       <description>Power Down AIN Comp3</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>on</name>
         <description>power on</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>off</name>
         <description>power off</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AINCOMPHYST</name>
       <description>Set Hysteresis on Analog Comparators</description>
       <bitOffset>4</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL</name>
     <description>Misc Power State Control Register</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>VDDCSWEN</name>
       <description>Allows switching VDDC from VCOREA to VCOREB</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDDCSW</name>
       <description>Controls switching of VCORE</description>
       <bitOffset>1</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>USBSWEN_N</name>
       <description>USB Switch Control</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>off</name>
         <description>USB SW off in LP modes</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>on</name>
         <description>USB SW On</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BUCKCLKSCALEN</name>
       <description>Allows Dynamic scaling of SIMO clock, reduces power in LP Modes</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>P1M</name>
       <description>Enable the Reset Pad Pull Up Resistors</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>1m</name>
         <description>1MOhm Pullup</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>25k</name>
         <description>25kOhm Pullup.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RSTN_VOLTAGE_SEL</name>
       <description>Error! Description not Found!</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
