pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
   </registers>
  </peripheral>
<!--PTG Pulse Train Generation-->
  <peripheral>
   <name>PWRSEQ</name>
   <description>Power Sequencer / Low Power Control Register.</description>
   <baseAddress>0x40006800</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>LPCN</name>
     <description>Low Power Control Register.</description>
     <addressOffset>0x00</addressOffset>
     <fields>
      <field>
       <name>RAMRET</name>
       <description>System RAM retention in BACKUP mode. These two bits are used in conjuction with RREGEN bit. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable Ram Retention.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en1</name>
         <description>Enable System RAM 0 retention.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en2</name>
         <description>Enable System RAM 0 and 1 retention.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en3</name>
         <description>Enable System RAM 0 and 1 retention, if RREGEN=0, Enable all System RAM retention.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BCKGRND</name>
       <description>Background Mode ENable. This bit allows low-power background mode operations, while the CPU is in DeepSleep.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FWKM</name>
       <description>Fast Wake-Up Mode. This bit enables fast wake-up from DeepSleep mode. (5uS typical). </description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BGOFF</name>
       <description>Bandgap OFF. This controls the System Bandgap in DeepSleep mode.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>on</name>
         <description>Bandgap is always ON.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>off</name>
         <description>Bandgap is OFF in DeepSleep mode(default).</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VCOREMD</name>
       <description>VDDC(Vcore) Monitor Disable. This bit controls the power monitor on the VCore supply in all operating modes.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable if Bandgap is ON(default)</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VREGIMD</name>
       <description>VRTC Monitor Disable. This bit controls the power monitor on the Always-On Supply in all operating modes.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable if Bandgap is ON(default)</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDDAMD</name>
       <description>VDDA Monitor Disable. This bit controls the power monitor of the Analog Supply in all operating modes.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable if Bandgap is ON(default)</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDDIOMD</name>
       <description>VDDIO Monitor Disable. This bit controls the power monitor of the Analog Supply in all operating modes.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable if Bandgap is ON(default)</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDDIOHMD</name>
       <description>VFDDIOH Monitor Disable. This bit controls the power monitor of the Analog Supply in all operating modes.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable if Bandgap is ON(default)</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PORVDDIOMD</name>
       <description>VDDIO Power-On Reset Monitor Disable. This bit controls the Power-On Reset monitor on VDDIO supply in all operating mods.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PORVDDIOHMD</name>
       <description>VDDIOH Power-On Reset Monitor Disable. This bit controls the Power-On Reset monitor on VDDIOH supply in all operating mods.</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDDBMD</name>
       <description>VDDB Power-On Reset Monitor Disable. This bit controls the Power-On Reset monitor on VDDB supply in all operating mods.</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VRXOUTMD</name>
       <description>VRXOUT Bluetooth Receiver Supply Power Monitor Disable .</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>VTXOUTMD</name>
       <description>VTXOUT Bluetooth Transmitter Supply Power Monitor Disable .</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PDOWNDSLEN</name>
       <description>PDOWN DEEPSLEEP Output Enable .</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LPWKST0</name>
     <description>Low Power I/O Wakeup Status Register 0. This register indicates the low power wakeup status for GPIO0.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>WAKEST</name>
       <description>Wakeup IRQ flags (write ones to clear). One or more of these bits will be set when the corresponding dedicated GPIO pin(s) transition(s) from low to high or high to low. If GPIO wakeup source is selected, using PM.GPIOWKEN register, and the corresponding bit is also selected in LPWKEN register, an interrupt will be gnerated to wake up the CPU from a low power mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LPWKEN0</name>
     <description>Low Power I/O Wakeup Enable Register 0. This register enables low power wakeup functionality for GPIO0.</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>WAKEEN</name>
       <description>Enable wakeup. These bits allow wakeup from the corresponding GPIO pin(s) on transition(s) from low to high or high to low when PM.GPIOWKEN is set. Wakeup status is indicated in PPWKST register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>31</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LPWKST1</name>
     <description>Low Power I/O Wakeup Status Register 1. This register indicates the low power wakeup status for GPIO1.</description>
     <addressOffset>0x0C</addressOffset>
     <fields>
      <field>
       <name>WAKEST</name>
       <description>Wakeup IRQ flags (write ones to clear). One or more of these bits will be set when the corresponding dedicated GPIO pin(s) transition(s) from low to high or high to low. If GPIO wakeup source is selected, using PM.GPIOWKEN register, and the corresponding bit is also selected in LPWKEN register, an interrupt will be gnerated to wake up the CPU from a low power mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>18</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LPWKEN1</name>
     <description>Low Power I/O Wakeup Enable Register 1. This register enables low power wakeup functionality for GPIO1.</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>WAKEEN</name>
       <description>Enable wakeup. These bits allow wakeup from the corresponding GPIO pin(s) on transition(s) from low to high or high to low when PM.GPIOWKEN is set. Wakeup status is indicated in PPWKST register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>31</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LPPWST</name>
     <description>Low Power Peripheral Wakeup Status Register.</description>
     <addressOffset>0x30</addressOffset>
     <fields>
      <field>
       <name>USBLSWKST</name>
       <description>USB UTMI Linestate Detect Wakeup Flag(write one to clear). One or both of these bits will be set when the USB bus activity causes the linestate to change and the device to wake while USB wakeup is enabled using PMLUSBWKEN.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>USBVBUSWKST</name>
       <description>USB VBUS Detect Wakeup Flag (write one to clear). This bit will be set when the USB power supply is powered on or powered off.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SDMAWKST</name>
       <description>SDMA Wakeup Status Flag.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP0WKST</name>
       <description>Analog Input Comparator 0 Wakeup Status Flag.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP1WKST</name>
       <description>Analog Input Comparator 1 Wakeup Status Flag.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP2WKST</name>
       <description>Analog Input Comparator 2 Wakeup Status Flag.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP3WKST</name>
       <description>Analog Input Comparator 3 Wakeup Status Flag.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP0ST</name>
       <description>Analog Input Comparator 0 Output Status Flag.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP1ST</name>
       <description>Analog Input Comparator 1 Output Status Flag.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP2ST</name>
       <description>Analog Input Comparator 2 Output Status Flag.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP3ST</name>
       <description>Analog Input Comparator 3 Output Status Flag.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BBMODEST</name>
       <description>Battery Back Wakeup Flag (write one to clear). This bit will be set when exiting Battery Backup Mode.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTWKST</name>
       <description>Reset Detect Wakeup Status Flag.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LPPWEN</name>
     <description>Low Power Peripheral Wakeup Enable Register.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>USBLSWKEN</name>
       <description>USB UTMI Linestate Detect Wakeup Enable. These bits allow wakeup from the corresponding USB linestate signal(s) on transition(s) from low to high or high to low when PM.USBWKEN is set.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>USBVBUSWKEN</name>
       <description>USB VBUS Detect Wakeup Enable. This bit allows wakeup from the USB power supply on or off status.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SDMAWKEN</name>
       <description>SDMA Wakeup Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP0WKEN</name>
       <description>Analog Input Comparator 0 Wakeup Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP1WKEN</name>
       <description>Analog Input Comparator 1 Wakeup Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP2WKEN</name>
       <description>Analog Input Comparator 2 Wakeup Enable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP3WKEN</name>
       <description>Analog Input Comparator 3 Wakeup Enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
