pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
    <register>
     <name>LPMEMSD</name>
     <description>Low Power Memory Shutdown Control.</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>SRAM0SD</name>
       <description>System RAM block 0 Shut Down.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRAM1SD</name>
       <description>System RAM block 1 Shut Down.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRAM2SD</name>
       <description>System RAM block 2 Shut Down.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRAM3SD</name>
       <description>System RAM block 3 Shut Down.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRAM4SD</name>
       <description>System RAM block 4 Shut Down.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRAM5SD</name>
       <description>System RAM block 5 Shut Down.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ICACHESD</name>
       <description>Instruction Cache RAM Shut Down.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ICACHEXIPSD</name>
       <description>XiP Instruction Cache RAM Shut Down.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRCCSD</name>
       <description>System Cache RAM Shut Down.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CRYPTOSD</name>
       <description>Crypto MAA RAM Shut Down.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>USBFIFOSD</name>
       <description>USB FIFO Shut Down.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ROMSD</name>
       <description>ROM Shut Down.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ROM1SD</name>
       <description>ROM1 Shut Down.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IC1SD</name>
       <description>ICache 1 Shut Down.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>LPVDDPD</name>
     <description>Low Power VDD Domain Power Down Control.</description>
     <addressOffset>0x44</addressOffset>
     <fields>
      <field>
       <name>VREGOBPD</name>
       <description>Power down SIMO Vreg B (VCOREB+VDDC) in backup mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>up</name>
         <description>Enabled in backup mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>down</name>
         <description>Disabled in backup mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VREGODPD</name>
       <description>Power down SIMO Vreg D (BTLE).</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>up</name>
         <description>Enabled</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>down</name>
         <description>Disabled</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDD2PD</name>
       <description>Power down VDD2 (CPU0+peripherals).</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>up</name>
         <description>Enabled</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>down</name>
         <description>Disabled</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDD3PD</name>
       <description>Power down VDD3 (CPU1+audio).</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>up</name>
         <description>Enabled</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>down</name>
         <description>Disabled</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDD4PD</name>
       <description>Power down VDD4 (SDMA+peripherals).</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>up</name>
         <description>Enabled</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>down</name>
         <description>Disabled</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>VDD5PD</name>
       <description>Power down VDD5 (BTLE digital).</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>up</name>
         <description>Enabled</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>down</name>
         <description>Disabled</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>BURETVEC</name>
     <description>BACKUP Return Vector Register</description>
     <addressOffset>0x48</addressOffset>
     <fields>
      <field>
       <name>GPR0</name>
       <description>General Purpose Register 0.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BUAOD</name>
     <description>BACKUP AoD Register</description>
     <addressOffset>0x4C</addressOffset>
     <fields>
      <field>
       <name>GPR1</name>
       <description>General Purpose Register 1.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
