pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
   </registers>
  </peripheral>
<!--RTC Real Time Clock and Alarm.-->
  <peripheral>
   <name>SDHC</name>
   <description>SDHC/SDIO Controller</description>
   <baseAddress>0x400B6000</baseAddress>
   <addressBlock>
    <offset>0</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>SDHC</name>
    <value>66</value>
   </interrupt>
   <registers>
    <register>
     <name>SDMA</name>
     <description>SDMA System Address / Argument 2.</description>
     <addressOffset>0x00</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>ADDR</name>
       <description>SDMA System Address / Argument 2  of Auto CMD23.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BLK_SIZE</name>
     <description>Block Size.</description>
     <addressOffset>0x04</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>TRANS</name>
       <description>Transfer Block Size.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>12</bitWidth>
      </field>
      <field>
       <name>HOST_BUFF</name>
       <description>Host SDMA Buffer Boundary.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BLK_CNT</name>
     <description>Block Count.</description>
     <addressOffset>0x06</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>COUNT</name>
       <description>Blocks Count For Current Transfer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ARG_1</name>
     <description>Argument 1.</description>
     <addressOffset>0x08</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>CMD</name>
       <description>Command Argument 1.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TRANS</name>
     <description>Transfer Mode.</description>
     <addressOffset>0x0C</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>DMA_EN</name>
       <description>DMA Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>enable</name>
        <enumeratedValue>
         <name>dma_transfer</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>non_dma_transfer</name>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BLK_CNT_EN</name>
       <description>Block Count Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>count</name>
        <enumeratedValue>
         <name>enable</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>disable</name>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AUTO_CMD_EN</name>
       <description>Auto CMD Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <name>CMD</name>
        <enumeratedValue>
         <name>disable</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>cmd12</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>cmd23</name>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>READ_WRITE</name>
       <description>Data Transfer Direction Select.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>read</name>
        <enumeratedValue>
         <name>read</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>write</name>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MULTI</name>
       <description>Multi / Single Block Select.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>multi</name>
        <enumeratedValue>
         <name>enable</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>disable</name>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>CMD</name>
     <description>Command.</description>
     <addressOffset>0x0E</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>RESP_TYPE</name>
       <description>Response Type Select.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>CRC_CHK_EN</name>
       <description>Command CRC Check Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IDX_CHK_EN</name>
       <description>Command Index Check Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_PRES_SEL</name>
       <description>Data Present Select.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TYPE</name>
       <description>Command Type.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>IDX</name>
       <description>Command Index.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>4</dimIncrement>
     <name>RESP[%s]</name>
     <description>Response 0 Register 0-15.</description>
     <addressOffset>0x010</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>CMD_RESP</name>
       <description>Command Response.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BUFFER</name>
     <description>Buffer Data Port.</description>
     <addressOffset>0x20</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>DATA</name>
       <description>Buffer Data.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PRESENT</name>
     <description>Present State.</description>
     <addressOffset>0x024</addressOffset>
     <size>32</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>CMD</name>
       <description>Command Inhibit (CMD).</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DAT</name>
       <description>Command Inhibit (DAT).</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DAT_LINE_ACTIVE</name>
       <description>DAT Line Active.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RETUNING</name>
       <description>Re-Tuning Request.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>WRITE_TRANSFER</name>
       <description>Write Transfer Active.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>READ_TRANSFER</name>
       <description>Read Transfer Active.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>BUFFER_WRITE</name>
       <description>Buffer Write Enable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>BUFFER_READ</name>
       <description>Buffer Read Enable.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CARD_INSERTED</name>
       <description>Card Inserted.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CARD_STATE</name>
       <description>Card State Stable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CARD_DETECT</name>
       <description>Card Detect Pin Level.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>WP</name>
       <description>Write Protect Switch Pin Level.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DAT_SIGNAL_LEVEL</name>
       <description>DAT[3:0] Line Signal Level.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>CMD_SIGNAL_LEVEL</name>
       <description>CMD Line Signal Level.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>HOST_CN_1</name>
     <description>Host Control 1.</description>
     <addressOffset>0x028</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>LED_CN</name>
       <description>LED Control.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_TRANSFER_WIDTH</name>
       <description>Data Transfer Width.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>HS_EN</name>
       <description>High Speed Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DMA_SELECT</name>
       <description>DMA Select.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>EXT_DATA_TRANSFER_WIDTH</name>
       <description>Extended Data Transfer Width.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_DETECT_TEST</name>
       <description>Card Detect Test Level.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_DETECT_SIGNAL</name>
       <description>Card Detect Signal Selection.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PWR</name>
     <description>Power Control.</description>
     <addressOffset>0x029</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>BUS_POWER</name>
       <description>SD Bus Power.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BUS_VOLT_SEL</name>
       <description>SD Bus Voltage Select.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BLK_GAP</name>
     <description>Block Gap Control.</description>
     <addressOffset>0x02A</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>STOP</name>
       <description>Stop At Block Gap Request.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CONT</name>
       <description>Continue Request.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>READ_WAIT</name>
       <description>Read Wait Control.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>INTR</name>
       <description>Interrupt At Block Gap.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>WAKEUP</name>
     <description>Wakeup Control.</description>
     <addressOffset>0x02B</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>CARD_INT</name>
       <description>Wakeup Event Enable On Card Interrupt.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_INS</name>
       <description>Wakeup Event Enable On SD Card Insertion.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_REM</name>
       <description>Wakeup Event Enable On SD Card Removal.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CLK_CN</name>
     <description>Clock Control.</description>
     <addressOffset>0x02C</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>INTERNAL_CLK_EN</name>
       <description>Internal Clock Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>INTERNAL_CLK_STABLE</name>
       <description>Internal Clock Stable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>SD_CLK_EN</name>
       <description>SD Clock Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CLK_GEN_SEL</name>
       <description>Clock Generator Select.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>UPPER_SDCLK_FREQ_SEL</name>
       <description>Upper Bits of SDCLK Frequency Select.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>SDCLK_FREQ_SEL</name>
       <description>SDCLK Frequency Select.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TO</name>
     <description>Timeout Control.</description>
     <addressOffset>0x02E</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>DATA_COUNT_VALUE</name>
       <description>Data Timeout Counter Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SW_RESET</name>
     <description>Software Reset.</description>
     <addressOffset>0x02F</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>RESET_ALL</name>
       <description>Software Reset For All.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RESET_CMD</name>
       <description>Software Reset For CMD Line.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RESET_DAT</name>
       <description>Software Reset For DAT Line.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INT_STAT</name>
     <description>Normal Interrupt Status.</description>
     <addressOffset>0x030</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>CMD_COMP</name>
       <description>Command Complete.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TRANS_COMP</name>
       <description>Transfer Complete.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BLK_GAP_EVENT</name>
       <description>Block Gap Event.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DMA</name>
       <description>DMA Interrupt.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BUFF_WR_READY</name>
       <description>Buffer Write Ready.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BUFF_RD_READY</name>
       <description>Buffer Read Ready.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_INSERTION</name>
       <description>Card Insertion.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_REMOVAL</name>
       <description>Card Removal.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_INTR</name>
       <description>Card Interrupt.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RETUNING</name>
       <description>Re-Tuning Event.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERR_INTR</name>
       <description>Error Interrupt.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ER_INT_STAT</name>
     <description>Error Interrupt Status.</description>
     <addressOffset>0x032</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>CMD_TO</name>
       <description>Command Timeout Error.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_CRC</name>
       <description>Command CRC Error.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_END_BIT</name>
       <description>Command End Bit Error.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_IDX</name>
       <description>Command Index Error.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_TO</name>
       <description>Data Timeout Error.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_CRC</name>
       <description>Data CRC Error.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_END_BIT</name>
       <description>Data End Bit Error.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CURRENT_LIMIT</name>
       <description>Current Limit Error.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AUTO_CMD_12</name>
       <description>Auto CMD Error.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ADMA</name>
       <description>ADMA Error.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DMA</name>
       <description>DMA Error.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INT_EN</name>
     <description>Normal Interrupt Status Enable.</description>
     <addressOffset>0x034</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>CMD_COMP</name>
       <description>Command Complete Status Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TRANS_COMP</name>
       <description>Transfer Complete Status Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BLK_GAP</name>
       <description>Block Gap Event Status Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DMA</name>
       <description>DMA Interrupt Status Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BUFFER_WR</name>
       <description>Buffer Write Ready Status Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BUFFER_RD</name>
       <description>Buffer Read Ready Status Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_INSERT</name>
       <description>Card Insertion Status Enable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_REMOVAL</name>
       <description>Card Removal Status Enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_INT</name>
       <description>Card Interrupt Status Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RETUNING</name>
       <description>Re-Tuning Event Status Enable.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
