pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
    <register>
     <name>ER_INT_EN</name>
     <description>Error Interrupt Status Enable.</description>
     <addressOffset>0x36</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>CMD_TO</name>
       <description>Command Timeout Error Status Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_CRC</name>
       <description>Command CRC Error Status Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_END_BIT</name>
       <description>Command End Bit Error Status Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_IDX</name>
       <description>Command Index Error Status Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_TO</name>
       <description>Data Timeout Error Status Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_CRC</name>
       <description>Data CRC Error Status Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_END_BIT</name>
       <description>Data End Bit Error Status Enable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AUTO_CMD</name>
       <description>Auto CMD Error Status Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ADMA</name>
       <description>ADMA Error Status Enable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TUNING</name>
       <description>Tuning Error Status Enable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>VENDOR</name>
       <description>Vendor Specific Error Status Enable.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INT_SIGNAL</name>
     <description>Normal Interrupt Signal Enable.</description>
     <addressOffset>0x038</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>CMD_COMP</name>
       <description>Command Complete Signal Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TRANS_COMP</name>
       <description>Transfer Complete Signal Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BLK_GAP</name>
       <description>Block Gap Event Signal Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DMA</name>
       <description>DMA Interrupt Signal Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BUFFER_WR</name>
       <description>Buffer Write Ready Signal Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BUFFER_RD</name>
       <description>Buffer Read Ready Signal Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_INSERT</name>
       <description>Card Insertion Signal Enable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_REMOVAL</name>
       <description>Card Removal Signal Enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARD_INT</name>
       <description>Card Interrupt Signal Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RETUNING</name>
       <description>Re-Tuning Event Signal Enable.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ER_INT_SIGNAL</name>
     <description>Error Interrupt Signal Enable.</description>
     <addressOffset>0x03A</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>CMD_TO</name>
       <description>Command Timeout Error Signal Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_CRC</name>
       <description>Command CRC Error Signal Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_END_BIT</name>
       <description>Command End Bit Error Signal Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CMD_IDX</name>
       <description>Command Index Error Signal Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_TO</name>
       <description>Data Timeout Error Signal Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_CRC</name>
       <description>Data CRC Error Signal Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_END_BIT</name>
       <description>Data End Bit Error Signal Enable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CURR_LIM</name>
       <description>Current Limit Error Signal Enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AUTO_CMD</name>
       <description>Auto CMD Error Signal Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ADMA</name>
       <description>ADMA Error Signal Enable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TUNING</name>
       <description>Tuning Error Signal Enable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TAR_RESP</name>
       <description>Target Response Error Signal Enable.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTO_CMD_ER</name>
     <description>Auto CMD Error Status.</description>
     <addressOffset>0x03C</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>NOT_EXCUTED</name>
       <description>Auto CMD12 Not Executed.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TO</name>
       <description>Auto CMD Timeout Error.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CRC</name>
       <description>Auto CMD CRC Error.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>END_BIT</name>
       <description>Auto CMD End Bit Error.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>INDEX</name>
       <description>Auto CMD Index Error.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>NOT_ISSUED</name>
       <description>Command Not Issued By Auto CMD12 Error.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>HOST_CN_2</name>
     <description>Host Control 2.</description>
     <addressOffset>0x03E</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>UHS</name>
       <description>UHS Mode Select.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>SIGNAL_V1_8</name>
       <description>1.8V Signaling Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>EXCUTE</name>
       <description>Execute Tuning.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SAMPLING_CLK</name>
       <description>Sampling Clock Select.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ASYNCH_INT</name>
       <description>Asynchronous Interrupt Enable.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PRESET_VAL_EN</name>
       <description>Preset Value Enable.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CFG_0</name>
     <description>Capabilities 0-31.</description>
     <addressOffset>0x040</addressOffset>
     <size>32</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>CLK_FREQ</name>
       <description>Timeout Clock Frequency.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>TO_CLK_UNIT</name>
       <description>Timeout Clock Unit.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>TO_CLK_FREQ</name>
       <description>Base Clock Frequency For SD Clock.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>MAX_BLK_LEN</name>
       <description>Max Block Length.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>BIT_8</name>
       <description>8-bit Support for Embedded Device.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>ADMA2</name>
       <description>ADMA2 Support.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>HS</name>
       <description>High Speed Support.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>SDMA</name>
       <description>SDMA Support.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>SUSPEND</name>
       <description>Suspend/Resume Support.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>V3_3</name>
       <description>Voltage Support 3.3V.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>V3_0</name>
       <description>Voltage Support 3.0V.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>V1_8</name>
       <description>Voltage Support 1.8V.</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>BIT_64_SYS_BUS</name>
       <description>64-bit System Bus Support.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>ASYNC_INT</name>
       <description>Asynchronous Interrupt Support.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>SLOT_TYPE</name>
       <description>Slot Type.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CFG_1</name>
     <description>Capabilities 32-63.</description>
     <addressOffset>0x044</addressOffset>
     <size>32</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDR50</name>
       <description>SDR50 Support.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>SDR104</name>
       <description>SDR104 Support.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>0</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DDR50</name>
       <description>DDR50 Support.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_A</name>
       <description>Driver Type A Support.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_C</name>
       <description>Driver Type C Support.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_D</name>
       <description>Driver Type D Support.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>TIMER_CNT_TUNING</name>
       <description>Timer Count for Re-Tuning.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>4</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>TUNING_SDR50</name>
       <description>Use Tuning for SDR50.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RETUNING</name>
       <description>Re-Tuning Modes.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_MULTI</name>
       <description>Clock Multiplier.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>MAX_CURR_CFG</name>
     <description>Maximum Current Capabilities.</description>
     <addressOffset>0x048</addressOffset>
     <size>32</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>V3_3</name>
       <description>Maximum Current for 3.3V.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>V3_0</name>
       <description>Maximum Current for 3.0V.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>V1_8</name>
       <description>Maximum Current for 1.8V.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FORCE_CMD</name>
     <description>Force Event for Auto CMD Error Status.</description>
     <addressOffset>0x050</addressOffset>
     <size>16</size>
     <access>write-only</access>
     <fields>
      <field>
       <name>NOT_EXCU</name>
       <description>Force Event for Auto CMD12 Not Executed.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TO</name>
       <description>Force Event for Auto CMD Timeout Error.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>CRC</name>
       <description>Force Event for Auto CMD CRC Error.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>END_BIT</name>
       <description>Force Event for Auto CMD End Bit Error.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>INDEX</name>
       <description>Force Event for Auto CMD Index Error.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>NOT_ISSUED</name>
       <description>Force Event for Command Not Issued By Auto CMD12 Error.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FORCE_EVENT_INT_STAT</name>
     <description>Force Event for Error Interrupt Status.</description>
     <addressOffset>0x052</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>CMD_TO</name>
       <description>Force Event for Command Timeout Error.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CMD_CRC</name>
       <description>Force Event for Command CRC Error.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CMD_END_BIT</name>
       <description>Force Event for Command End Bit Error.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CMD_INDEX</name>
       <description>Force Event for Command Index Error.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DATA_TO</name>
       <description>Force Event for Data Timeout Error.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DATA_CRC</name>
       <description>Force Event for Data CRC Error.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DATA_END_BIT</name>
       <description>Force Event for Data End Bit Error.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CURR_LIMIT</name>
       <description>Force Event for Current Limit Error.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>AUTO_CMD</name>
       <description>Force Event for Auto CMD Error.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>ADMA</name>
       <description>Force Event for ADMA Error.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>VENDOR</name>
       <description>Force Event for Vendor Specific Error Status.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>3</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>ADMA_ER</name>
     <description>ADMA Error Status.</description>
     <addressOffset>0x054</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>STATE</name>
       <description>ADMA Error State.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>LEN_MISMATCH</name>
       <description>ADMA Length Mismatch Error.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADMA_ADDR_0</name>
     <description>ADMA System Address 0-31.</description>
     <addressOffset>0x058</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>ADDR</name>
       <description>ADMA System Address  Part 1 (part 2 is ADMA_ADDR_1).</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADMA_ADDR_1</name>
     <description>ADMA System Address 32-63.</description>
     <addressOffset>0x05C</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>ADDR</name>
       <description>ADMA System Address  Part 1 (part 2 is ADMA_ADDR_1).</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PRESET_0</name>
     <description>Preset Value for Initialization.</description>
     <addressOffset>0x060</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDCLK_FREQ</name>
       <description>SDCLK Frequency Select Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_GEN</name>
       <description>Clock Generator Select Value.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select Value.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PRESET_1</name>
     <description>Preset Value for Default Speed.</description>
     <addressOffset>0x062</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDCLK_FREQ</name>
       <description>SDCLK Frequency Select Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_GEN</name>
       <description>Clock Generator Select Value.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select Value.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
