pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
   </registers>
  </peripheral>
<!--SPIXR SPIXR peripheral.-->
  <peripheral>
   <name>SRCC</name>
   <description>External Memory Cache Controller Registers.</description>
   <baseAddress>0x40033000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CACHE_ID</name>
     <description>Cache ID Register.</description>
     <addressOffset>0x0000</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>RELNUM</name>
       <description>Release Number. Identifies the RTL release version.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>PARTNUM</name>
       <description>Part Number. This field reflects the value of C_ID_PART_NUMBER configuration parameter.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>CCHID</name>
       <description>Cache ID. This field reflects the value of the C_ID_CACHEID configuration parameter.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MEMCFG</name>
     <description>Memory Configuration Register.</description>
     <addressOffset>0x0004</addressOffset>
     <access>read-only</access>
     <resetValue>0x00080008</resetValue>
     <fields>
      <field>
       <name>CCHSZ</name>
       <description>Cache Size. Indicates total size in Kbytes of cache.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
      <field>
       <name>MEMSZ</name>
       <description>Main Memory Size. Indicates the total size, in units of 128 Kbytes, of code memory accessible to the cache controller.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CACHE_CTRL</name>
     <description>Cache Control and Status Register.</description>
     <addressOffset>0x0100</addressOffset>
     <fields>
      <field>
       <name>CACHE_EN</name>
       <description>Cache Enable. Controls whether the cache is bypassed or is in use. Changing the state of this bit will cause the instruction cache to be flushed and its contents invalidated.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Cache Bypassed. Instruction data is stored in the line fill buffer but is not written to main cache memory array.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Cache Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>WRITE_ALLOC</name>
       <description>Write Allocate Enable. This bit only writable while the cache is disabled.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Write-no-allocate.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Write-allocate enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CWFST_DIS</name>
       <description>Critical word first and streaming disable. This bit only writeable while the cache is disabled.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Critical word first and streaming disabled.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Critical word first and streaming enabled.</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CACHE_RDY</name>
       <description>Cache Ready flag. Cleared by hardware when at any time the cache as a whole is invalidated (including a system reset). When this bit is 0, the cache is effectively in bypass mode (instruction fetches will come from main memory or from the line fill buffer). Set by hardware when the invalidate operation is complete and the cache is ready.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>notReady</name>
         <description>Not Ready.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>Ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INVALIDATE</name>
     <description>Invalidate All Cache Contents. Any time this register location is written (regardless of the data value), the cache controller immediately begins invalidating the entire contents of the cache memory. The cache will be in bypass mode until the invalidate operation is complete. System software can examine the Cache Ready bit (CACHE_CTRL.CACHE_RDY) to determine when the invalidate operation is complete. Note that it is not necessary to disable the cache controller prior to beginning this operation. Reads from this register always return 0.</description>
     <addressOffset>0x0700</addressOffset>
     <fields>
      <field>
       <name>IA</name>
       <description>Invalidate all cache contents.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--SRCC External Memory Cache Controller Registers.-->
  <peripheral>
   <name>TMR0</name>
   <description>32-bit reloadable timer that can be used for timing and event counting.</description>
   <groupName>Timers</groupName>
   <baseAddress>0x40010000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>TMR0</name>
    <description>TMR0 IRQ</description>
    <value>5</value>
   </interrupt>
   <registers>
    <register>
     <name>CNT</name>
     <description>Count.  This register stores the current timer count.</description>
     <addressOffset>0x00</addressOffset>
     <resetValue>0x00000001</resetValue>
    </register>
    <register>
     <name>CMP</name>
     <description>Compare.  This register stores the compare value, which is used to set the maximum count value to initiate a reload of the timer to 0x0001.</description>
     <addressOffset>0x04</addressOffset>
     <resetValue>0x0000FFFF</resetValue>
    </register>
    <register>
     <name>PWM</name>
     <description>PWM.  This register stores the value that is compared to the current timer count.</description>
     <addressOffset>0x08</addressOffset>
    </register>
    <register>
     <name>INTR</name>
     <description>Clear Interrupt. Writing a value (0 or 1) to a bit in this register clears the associated interrupt.</description>
     <addressOffset>0x0C</addressOffset>
     <modifiedWriteValues>oneToClear</modifiedWriteValues>
     <fields>
      <field>
       <name>IRQ</name>
       <description>Clear Interrupt.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CN</name>
     <description>Timer Control Register.</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>TMODE</name>
       <description>Timer Mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>oneShot</name>
         <description>One Shot Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>continuous</name>
         <description>Continuous Mode.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>counter</name>
         <description>Counter Mode.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pwm</name>
         <description>PWM Mode.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>capture</name>
         <description>Capture Mode.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>compare</name>
         <description>Compare Mode.</description>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>gated</name>
         <description>Gated Mode.</description>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>captureCompare</name>
         <description>Capture/Compare Mode.</description>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PRES</name>
       <description>Prescaler.  Set the Timer's prescaler value. The prescaler divides the PCLK input to the timer and sets the Timer's Count Clock, F_CNT_CLK = PCLK (HZ) /prescaler. The Timer's prescaler setting is a 4-bit value with pres3:pres[2:0].</description>
       <bitOffset>3</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>div1</name>
         <description>Divide by 1.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div2</name>
         <description>Divide by 2.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div4</name>
         <description>Divide by 4.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div8</name>
         <description>Divide by 8.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div16</name>
         <description>Divide by 16.</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div32</name>
         <description>Divide by 32.</description>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div64</name>
         <description>Divide by 64.</description>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div128</name>
         <description>Divide by 128.</description>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TPOL</name>
       <description>Timer input/output polarity bit.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>activeHi</name>
         <description>Active High.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>activeLo</name>
         <description>Active Low.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TEN</name>
       <description>Timer Enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PRES3</name>
       <description>MSB of prescaler value.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PWMSYNC</name>
       <description>Timer PWM Synchronization Mode Enable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>NOLHPOL</name>
       <description>Timer PWM output 0A polarity bit.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>NOLLPOL</name>
       <description>Timer PWM output 0A' polarity bit.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PWMCKBD</name>
       <description>Timer PWM output 0A Mode Disable.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>NOLCMP</name>
     <description>Timer Non-Overlapping Compare Register.</description>
     <addressOffset>0x14</addressOffset>
     <fields>
      <field>
       <name>NOLLCMP</name>
       <description>Non-overlapping Low Compare.  The 8-bit timer count value of non-overlapping time between falling edge of PWM output 0A and next rising edge of PWM output 0A'.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>NOLHCMP</name>
       <description>Non-overlapping High Compare.  The 8-bit timer count value of non-overlapping time between falling edge of PWM output 0A' and next rising edge of PWM output 0A.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
