pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
   </registers>
  </peripheral>
<!--TPU The Trust Protection Unit used to assist the computationally intensive operations of several common cryptographic algorithms.-->
  <peripheral>
   <name>TRNG</name>
   <description>Random Number Generator.</description>
   <baseAddress>0x4004D000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>TRNG</name>
    <description>TRNG interrupt.</description>
    <value>4</value>
   </interrupt>
   <registers>
    <register>
     <name>CN</name>
     <description>TRNG Control Register.</description>
     <addressOffset>0x00</addressOffset>
     <resetValue>0x00000003</resetValue>
     <fields>
      <field>
       <name>ODHT</name>
       <description>Start On-Demand health test</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RND_IRQ_EN</name>
       <description>To enable IRQ generation when a new 32-bit Random number is ready.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>disable</name>
         <description>Disable</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>enable</name>
         <description>Enable</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>HEALTH_EN</name>
       <description>To enable IRQ generation when a health test fails</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>disable</name>
         <description>disable</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>enable</name>
         <description>enable</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AESKG_MEU</name>
       <description>AES Key Generate. When enabled, the key for securing NVSRAM is generated and transferred to the secure key register automatically without user visibility or intervention. This bit is cleared by hardware once the key has been transferred to the secure key register.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="AESKG_MEU">
       <name>AESKG_MEMPROTE</name>
       <description>AES Key Generate. When enabled, the key for securing NVSRAM is generated and transferred to the secure key register automatically without user visibility or intervention. This bit is cleared by hardware once the key has been transferred to the secure key register.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="AESKG_MEU">
       <name>AESKG_MEMPROTA</name>
       <description>AES Key Generate. When enabled, the key for securing NVSRAM is generated and transferred to the secure key register automatically without user visibility or intervention. This bit is cleared by hardware once the key has been transferred to the secure key register.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ST</name>
     <description>Data. The content of this register is valid only when RNG_IS = 1. When TRNG is disabled, read returns 0x0000 0000.</description>
     <addressOffset>0x04</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>RND_RDY</name>
       <description>32-bit random data is ready to read from TRNG_DATA register. Reading TRNG_DATA when RND_RDY=0 will return all 0's. IRQ is generated when RND_RDY=1 if TRNG_CN.RND_IRQ_EN=1.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Busy</name>
         <description>TRNG Busy</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Ready</name>
         <description>32 bit random data is ready</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ODHTS</name>
       <description>On-Demand health test status</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Done</name>
         <description>On demand health test done</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Busy</name>
         <description>On demand health test on going</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>HTS</name>
       <description>Health test status. This bit shall be read when On-demand health test is completed (ODHTS=0) to check the result. This bit is also set when a continuous health test reports an error, IRQ is generated if HEALTH_EN=1. Write 1 to clear this bit.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Pass</name>
         <description>Pass</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Fail</name>
         <description>Fail</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SRCFAIL</name>
       <description>Entropy source has failed. IRQ is generated if HEALTH_EN=1. Write 1 to clear this bit.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Works</name>
         <description>Entopy source works correctly</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Fail</name>
         <description>Entropy Source has failed</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AESKGD_MEU_S</name>
       <description>Automatically AES transfer on going</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>DATA</name>
     <description>Data. The content of this register is valid only when RNG_IS = 1. When TRNG is disabled, read returns 0x0000 0000.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data. The content of this register is valid only when RNG_IS =1. When TNRG is disabled, read returns 0x0000 0000.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
