pyocd/pyOCD/pyocd/debug/svd/data/max32665.svd
    <register>
     <name>DMA</name>
     <description>DMA Configuration.</description>
     <addressOffset>0x20</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>TXDMA_EN</name>
       <description>TX DMA channel enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>DMA is disabled </description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>DMA is enabled </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RXDMA_EN</name>
       <description>RX DMA channel enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>DMA is disabled </description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>DMA is enabled </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RXDMA_START</name>
       <description>Receive DMA Start.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RXDMA_AUTO_TO</name>
       <description>Receive DMA Timeout Start.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TXDMA_LEVEL</name>
       <description>TX threshold for DMA transmission.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>RXDMA_LEVEL</name>
       <description>RX threshold for DMA transmission.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TX_FIFO</name>
     <description>Transmit FIFO Status register.</description>
     <addressOffset>0x24</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>DATA</name>
       <description>Reading from this field returns the next character available at the output of the TX FIFO (if one is available, otherwise 00h is returned).</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--UART0 UART-->
  <peripheral derivedFrom="UART0">
   <name>UART1</name>
   <description>UART 1</description>
   <baseAddress>0x40043000</baseAddress>
   <interrupt>
    <name>UART1</name>
    <description>UART1 IRQ</description>
    <value>15</value>
   </interrupt>
  </peripheral>
<!--UART1 UART 1-->
  <peripheral derivedFrom="UART0">
   <name>UART2</name>
   <description>UART 2</description>
   <baseAddress>0x40044000</baseAddress>
   <interrupt>
    <name>UART2</name>
    <description>UART2 IRQ</description>
    <value>34</value>
   </interrupt>
  </peripheral>
<!--UART2 UART 2-->
  <peripheral>
   <name>USBHS</name>
   <description>USB 2.0 High-speed Controller.</description>
   <baseAddress>0x400B1000</baseAddress>
   <addressBlock>
    <offset>0</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>USB</name>
    <value>2</value>
   </interrupt>
   <registers>
    <register>
     <name>FADDR</name>
     <description>Function address register.</description>
     <addressOffset>0x00</addressOffset>
     <size>8</size>
     <resetMask>0x00</resetMask>
     <fields>
      <field>
       <name>ADDR</name>
       <description>Function address for this controller.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>UPDATE</name>
       <description>Set when ADDR is written, cleared when new address takes effect.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>POWER</name>
     <description>Power management register.</description>
     <addressOffset>0x01</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>EN_SUSPENDM</name>
       <description>Enable SUSPENDM signal.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SUSPEND</name>
       <description>Suspend mode detected.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RESUME</name>
       <description>Generate resume signaling.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RESET</name>
       <description>Bus reset detected.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>HS_MODE</name>
       <description>High-speed mode detected.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>HS_ENABLE</name>
       <description>High-speed mode enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SOFTCONN</name>
       <description>Softconn.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>ISO_UPDATE</name>
       <description>Wait for SOF during Isochronous xfers.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTRIN</name>
     <description>Interrupt register for EP0 and IN EP1-15.</description>
     <addressOffset>0x02</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>EP15_IN_INT</name>
       <description>Endpoint 15 interrupt.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP14_IN_INT</name>
       <description>Endpoint 14 interrupt.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP13_IN_INT</name>
       <description>Endpoint 13 interrupt.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP12_IN_INT</name>
       <description>Endpoint 12 interrupt.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP11_IN_INT</name>
       <description>Endpoint 11 interrupt.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP10_IN_INT</name>
       <description>Endpoint 10 interrupt.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP9_IN_INT</name>
       <description>Endpoint 9 interrupt.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP8_IN_INT</name>
       <description>Endpoint 8 interrupt.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP7_IN_INT</name>
       <description>Endpoint 7 interrupt.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP6_IN_INT</name>
       <description>Endpoint 6 interrupt.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP5_IN_INT</name>
       <description>Endpoint 5 interrupt.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP4_IN_INT</name>
       <description>Endpoint 4 interrupt.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP3_IN_INT</name>
       <description>Endpoint 3 interrupt.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP2_IN_INT</name>
       <description>Endpoint 2 interrupt.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP1_IN_INT</name>
       <description>Endpoint 1 interrupt.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP0_IN_INT</name>
       <description>Endpoint 0 interrupt.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTROUT</name>
     <description>Interrupt register for OUT EP 1-15.</description>
     <addressOffset>0x04</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>EP15_OUT_INT</name>
       <description>Endpoint 15 interrupt.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP14_OUT_INT</name>
       <description>Endpoint 14 interrupt.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP13_OUT_INT</name>
       <description>Endpoint 13 interrupt.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP12_OUT_INT</name>
       <description>Endpoint 12 interrupt.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP11_OUT_INT</name>
       <description>Endpoint 11 interrupt.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP10_OUT_INT</name>
       <description>Endpoint 10 interrupt.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP9_OUT_INT</name>
       <description>Endpoint 9 interrupt.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP8_OUT_INT</name>
       <description>Endpoint 8 interrupt.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP7_OUT_INT</name>
       <description>Endpoint 7 interrupt.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP6_OUT_INT</name>
       <description>Endpoint 6 interrupt.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP5_OUT_INT</name>
       <description>Endpoint 5 interrupt.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP4_OUT_INT</name>
       <description>Endpoint 4 interrupt.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP3_OUT_INT</name>
       <description>Endpoint 3 interrupt.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP2_OUT_INT</name>
       <description>Endpoint 2 interrupt.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>EP1_OUT_INT</name>
       <description>Endpoint 1 interrupt.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTRINEN</name>
     <description>Interrupt enable for EP 0 and IN EP 1-15.</description>
     <addressOffset>0x06</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>EP15_IN_INT_EN</name>
       <description>Endpoint 15 interrupt enable.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP14_IN_INT_EN</name>
       <description>Endpoint 14 interrupt enable.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP13_IN_INT_EN</name>
       <description>Endpoint 13 interrupt enable.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP12_IN_INT_EN</name>
       <description>Endpoint 12 interrupt enable.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP11_IN_INT_EN</name>
       <description>Endpoint 11 interrupt enable.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP10_IN_INT_EN</name>
       <description>Endpoint 10 interrupt enable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP9_IN_INT_EN</name>
       <description>Endpoint 9 interrupt enable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP8_IN_INT_EN</name>
       <description>Endpoint 8 interrupt enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP7_IN_INT_EN</name>
       <description>Endpoint 7 interrupt enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP6_IN_INT_EN</name>
       <description>Endpoint 6 interrupt enable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP5_IN_INT_EN</name>
       <description>Endpoint 5 interrupt enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP4_IN_INT_EN</name>
       <description>Endpoint 4 interrupt enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP3_IN_INT_EN</name>
       <description>Endpoint 3 interrupt enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP2_IN_INT_EN</name>
       <description>Endpoint 2 interrupt enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP1_IN_INT_EN</name>
       <description>Endpoint 1 interrupt enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP0_INT_EN</name>
       <description>Endpoint 0 interrupt enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTROUTEN</name>
     <description>Interrupt enable for OUT EP 1-15.</description>
     <addressOffset>0x08</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>EP15_OUT_INT_EN</name>
       <description>Endpoint 15 interrupt.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP14_OUT_INT_EN</name>
       <description>Endpoint 14 interrupt.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP13_OUT_INT_EN</name>
       <description>Endpoint 13 interrupt.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP12_OUT_INT_EN</name>
       <description>Endpoint 12 interrupt.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP11_OUT_INT_EN</name>
       <description>Endpoint 11 interrupt.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP10_OUT_INT_EN</name>
       <description>Endpoint 10 interrupt.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP9_OUT_INT_EN</name>
       <description>Endpoint 9 interrupt.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP8_OUT_INT_EN</name>
       <description>Endpoint 8 interrupt.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP7_OUT_INT_EN</name>
       <description>Endpoint 7 interrupt.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP6_OUT_INT_EN</name>
       <description>Endpoint 6 interrupt.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP5_OUT_INT_EN</name>
       <description>Endpoint 5 interrupt.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP4_OUT_INT_EN</name>
       <description>Endpoint 4 interrupt.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP3_OUT_INT_EN</name>
       <description>Endpoint 3 interrupt.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP2_OUT_INT_EN</name>
       <description>Endpoint 2 interrupt.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>EP1_OUT_INT_EN</name>
       <description>Endpoint 1 interrupt.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTRUSB</name>
     <description>Interrupt register for common USB interrupts.</description>
     <addressOffset>0x0A</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>SOF_INT</name>
       <description>Start of Frame.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RESET_INT</name>
       <description>Bus reset detected.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RESUME_INT</name>
       <description>Resume detected.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>SUSPEND_INT</name>
       <description>Suspend detected.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTRUSBEN</name>
     <description>Interrupt enable for common USB interrupts.</description>
     <addressOffset>0x0B</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>SOF_INT_EN</name>
       <description>Start of Frame.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RESET_INT_EN</name>
       <description>Bus reset detected.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RESUME_INT_EN</name>
       <description>Resume detected.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SUSPEND_INT_EN</name>
       <description>Suspend detected.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FRAME</name>
     <description>Frame number.</description>
     <addressOffset>0x0C</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>FRAMENUM</name>
       <description>Read the last received frame number, that is the 11-bit frame number received in the SOF packet.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>11</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INDEX</name>
     <description>Index for banked registers.</description>
     <addressOffset>0x0E</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>INDEX</name>
       <description>Index Register Access Selector. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
